app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "admin@kilos.com"]]
---
	def create
		@user = User.find_by_email(params[:session][:email])