app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
			if @user.save
---
INSERT INTO "users" ("user_name", "email", "password_digest", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"