app/controllers/videos_controller.rb

	def index
		@videos = Video.all
---
SELECT "videos".* FROM "videos"

	def show
		@video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		@video = Video.new(video_params)
		@video.user_id = current_user.id

			if @video.save
---
INSERT INTO "videos" ("source", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["source", "new"], ["title", "sheit"], ["description", "kjsdfka"], ["user_id", 2], ["created_at", "2015-06-06 21:57:15.194355"], ["updated_at", "2015-06-06 21:57:15.194355"]]

	def edit
		@video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 0]]

	def update
		@video = Video.find(params[:id])
		if @video.update_attributes(video_params)
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "videos" SET "source" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["source", "https://www.youtube.com/watch?v=mtQvMfBQYXA"], ["updated_at", "2015-06-06 22:32:28.801076"], ["id", 14]]

	def destroy
		@video = Video.find(params[:id])
		@video.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 7]]